mslawicz/Zigbee_OnOff_Srv_Distrib/STM32_WPAN/App/app_zigbee.c
/* ColorControl server move_to_hue_sat 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_sat(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueSatReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 9 ColorControl server 1 move_to_hue_sat 1 */
	APP_DBG("colorControl_server_1_move_to_hue_sat");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 9 ColorControl server 1 move_to_hue_sat 1 */
}

/* ColorControl server move_to_color_xy 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_color_xy(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToColorXYReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 10 ColorControl server 1 move_to_color_xy 1 */
	APP_DBG("colorControl_server_1_move_to_color_xy (x=%d y=%d)", req->color_x, req->color_y);

	(void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_CURRENT_X, req->color_x);
	(void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_CURRENT_Y, req->color_y);

	convert_xy_to_RGB(req->color_x, req->color_y, &RGB_params.color);
	/* execute action if the device is on */
	if(RGB_params.OnOff != 0)
	{
		RGB_params.mode = Mode_Static;
		RGB_LED_action(appTimer);
	}

  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 10 ColorControl server 1 move_to_color_xy 1 */
}

/* ColorControl server move_color_xy 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_color_xy(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveColorXYReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 11 ColorControl server 1 move_color_xy 1 */
	APP_DBG("colorControl_server_1_move_color_xy");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 11 ColorControl server 1 move_color_xy 1 */
}

/* ColorControl server step_color_xy 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_xy(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorXYReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 12 ColorControl server 1 step_color_xy 1 */
	APP_DBG("colorControl_server_1_step_color_xy");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 12 ColorControl server 1 step_color_xy 1 */
}

/* ColorControl server move_to_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 13 ColorControl server 1 move_to_color_temp 1 */
	APP_DBG("colorControl_server_1_move_to_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 13 ColorControl server 1 move_to_color_temp 1 */
}

/* ColorControl server move_to_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 14 ColorControl server 1 move_to_hue_enh 1 */
	APP_DBG("colorControl_server_1_move_to_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 14 ColorControl server 1 move_to_hue_enh 1 */
}

/* ColorControl server move_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 15 ColorControl server 1 move_hue_enh 1 */
	APP_DBG("colorControl_server_1_move_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 15 ColorControl server 1 move_hue_enh 1 */
}

/* ColorControl server step_hue_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_hue_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepHueEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 16 ColorControl server 1 step_hue_enh 1 */
	APP_DBG("colorControl_server_1_step_hue_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 16 ColorControl server 1 step_hue_enh 1 */
}

/* ColorControl server move_to_hue_sat_enh 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_to_hue_sat_enh(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveToHueSatEnhReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 17 ColorControl server 1 move_to_hue_sat_enh 1 */
	APP_DBG("colorControl_server_1_move_to_hue_sat_enh");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 17 ColorControl server 1 move_to_hue_sat_enh 1 */
}

/* ColorControl server color_loop_set 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_color_loop_set(struct ZbZclClusterT *cluster, struct ZbZclColorClientColorLoopSetReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 18 ColorControl server 1 color_loop_set 1 */
	APP_DBG("colorControl_server_1_color_loop_set");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 18 ColorControl server 1 color_loop_set 1 */
}

/* ColorControl server stop_move_step 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_stop_move_step(struct ZbZclClusterT *cluster, struct ZbZclColorClientStopMoveStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 19 ColorControl server 1 stop_move_step 1 */
	APP_DBG("colorControl_server_1_stop_move_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 19 ColorControl server 1 stop_move_step 1 */
}

/* ColorControl server move_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 20 ColorControl server 1 move_color_temp 1 */
	APP_DBG("xxxxx");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 20 ColorControl server 1 move_color_temp 1 */
}

/* ColorControl server step_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 21 ColorControl server 1 step_color_temp 1 */
	APP_DBG("colorControl_server_1_move_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 21 ColorControl server 1 step_color_temp 1 */
}

